CF/Documents/ПоложениеОПремировании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПоложениеОПремировании</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДействующиеПравилаРасчетаПремий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляВсехМагазиновОдноПоложение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляВсехМагазинов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Магазины</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Магазин</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПравилаРасчетаПремий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПравилоРасчетаПремий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПравилаРасчетаПремий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Магазин</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CF/Documents/ПоложениеОПремировании/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Если ДокументСсылка.ДляВсехМагазинов ИЛИ НЕ ДокументСсылка.ДляВсехМагазиновОдноПоложение Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПоложениеОПремированииПравилаРасчетаПремий.Ссылка КАК Ссылка,
		|	ПоложениеОПремированииПравилаРасчетаПремий.НомерСтроки КАК НомерСтроки,
		|	ПоложениеОПремированииПравилаРасчетаПремий.Ссылка.ДатаНачалаДействия КАК ПЕРИОД,
		|	ПоложениеОПремированииПравилаРасчетаПремий.Ссылка.ДатаОкончанияДействия КАК ДатаОкончания,
		|	ПоложениеОПремированииПравилаРасчетаПремий.Магазин КАК Магазин,
		|	ПоложениеОПремированииПравилаРасчетаПремий.ПравилоРасчетаПремий КАК ПравилоРасчетаПремий
		|ИЗ
		|	Документ.ПоложениеОПремировании.ПравилаРасчетаПремий КАК ПоложениеОПремированииПравилаРасчетаПремий
		|ГДЕ
		|	ПоложениеОПремированииПравилаРасчетаПремий.Ссылка = &Ссылка
		|";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПоложениеОПремированииПравилаРасчетаПремий.Ссылка КАК Ссылка,
		|	ПоложениеОПремированииПравилаРасчетаПремий.НомерСтроки КАК НомерСтроки,
		|	ПоложениеОПремированииПравилаРасчетаПремий.Ссылка.ДатаНачалаДействия КАК ПЕРИОД,
		|	ПоложениеОПремированииПравилаРасчетаПремий.Ссылка.ДатаОкончанияДействия КАК ДатаОкончания,
		|	ПоложениеОПремированииПравилаРасчетаПремий.ПравилоРасчетаПремий КАК ПравилоРасчетаПремий
		|ПОМЕСТИТЬ ТаблицаПравилаРасчетаПремий
		|ИЗ
		|	Документ.ПоложениеОПремировании.ПравилаРасчетаПремий КАК ПоложениеОПремированииПравилаРасчетаПремий
		|ГДЕ
		|	ПоложениеОПремированииПравилаРасчетаПремий.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоложениеОПремированииМагазины.Ссылка,
		|	ПоложениеОПремированииМагазины.Магазин
		|ПОМЕСТИТЬ ТаблицаМагазины
		|ИЗ
		|	Документ.ПоложениеОПремировании.Магазины КАК ПоложениеОПремированииМагазины
		|ГДЕ
		|	ПоложениеОПремированииМагазины.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ТаблицаМагазины.Магазин, ЗНАЧЕНИЕ(Справочник.Магазины.ПустаяСсылка)) КАК Магазин,
		|	ТаблицаПравилаРасчетаПремий.НомерСтроки,
		|	ТаблицаПравилаРасчетаПремий.ПЕРИОД,
		|	ТаблицаПравилаРасчетаПремий.ДатаОкончания,
		|	ТаблицаПравилаРасчетаПремий.ПравилоРасчетаПремий
		|ИЗ
		|	ТаблицаМагазины КАК ТаблицаМагазины,
		|	ТаблицаПравилаРасчетаПремий КАК ТаблицаПравилаРасчетаПремий
		|";
		
	КонецЕсли;
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаДействующихПравил", ТаблицаРезультат);
	
КонецПроцедуры

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
